package org.cars.utils;

public class UIMessage {

    public static final String MENU_SELECT_ACTION = "\nНажмите:\n" +
            "0 - закончить работу\n" +
            "1 - создать таблицу\n" +
            "2 - заполнить таблицу тестовыми данными\n" +
            "3 - добавить новый автомобиль в таблицу\n" +
            "4 - удалить автомобиль по номеру id\n" +
            "5 - вывести все данные из таблицы\n" +
            "6 - сортировка данных";

    public static final String MENU_SORTING_DATA = "Нажмите:\n"+
            "1 - вывести список, отсортированный по бренду в порядке возрастания\n"+
            "2 - вывести список, отсортированный по бренду в порядке убывания\n"+
            "3 - вывести список, отсортированный по цене в порядке возрастания\n"+
            "4 - вывести список, отсортированный по цене в порядке убывания\n" +
            "5 - вывести список, отсортированный по бренду\n" +
            "6 - вывести список, отсортированный по модели\n" +
            "7 - вывести список автомобилей с ценой в диапазоне\n" +
            "8 - вывести список автомобилей с максимальной ценой\n" +
            "9 - вывести список автомобилей с минимальной ценой";
}
